/* Click the lock to make changes. */
"kClickLockMakeChange" = "Click the lock to make changes.";

/* Click the lock to prevent further changes. */
"kClickLockPreventChange" = "Click the lock to prevent further changes.";

/* open panel title */
"kTitle" = "Title";

/* open panel prompt */
"kChoose" = "Choose";

/* new key name */
"kKey" = "Key";

/* new key value */
"kValue" = "Value";

/* display file sizes */
"kBytes" = "%d KB";

/* <Not pooled> */
"kNotPooled" = "<Not pooled>";

/* <Not installed> */
"kNotInstalled" = "<Not installed>";

/* overwrite driver */
"kOverwriteDriverTitle" = "Overwrite Driver";

/* overwrite driver */
"kOverwriteDriver" = "A driver with that name already exists. Are you sure you want to overwrite this driver?";

/* overwrite dsn */
"kOverwriteDSNTitle" = "Overwrite DSN";

/* overwrite dsn */
"kOverwriteDSN" = "A DSN with that name already exists. Are you sure you want to overwrite this DSN?";

/* invalid name */
"kInvalidNameTitle" = "Invalid Name";

/* invalid DSN name */
"kInvalidDSNName" = "The DSN name you have entered is invalid. DSN names must consist only of letters and digits and must begin with a letter.";

/* invalid Key name */
"kInvalidKeyName" = "A Key name you have entered is invalid. Key names must consist only of letters and digits, and must begin with a letter.";

/* invalid path */
"kInvalidPathTitle" = "Invalid Path";

/* an error has occurred and I don't have string for it */
"kOhNo" = "An error has occurred.";

/* Error */
"kError" = "Error";

/* remove DSN */
"kDeleteDSNMessage" = "Are you sure you want to remove the selected DSN?";

/* remove driver */
"kDeleteDriverMessage" = "Are you sure you want to remove the selected driver?";

/* remove DSNs too */
"kDeleteAssociatedDSNs" = "Do you want to remove all the DSN information associated with this driver?";

/* something happened attempting to add a driver */
"kCantAddDriver" = "Could not add the driver information.";

/* something happened attempting to add DSN */
"kCantAddDSN." = "Could not add the DSN information.";

/* Not enough parameters for configuration */
"kNotEnough" = "Not enough parameters for configuration.";

/* Could not remove driver information */
"kCantRemoveDriver" = "Could not remove driver information.";

/* Could not remove DSN information */
"kCantRemoveDSN" = "Could not remove DSN information.";

/* Revert */
"kRevert" = "Revert";

/* Revert to the original configuration */
"kRevertMessage" = "Revert to the original configuration?";

/* Delete Driver */
"kDeleteDriverTitle" = "Delete Driver";

/* Delete DSN */
"kDeleteDSNTitle" = "Delete DSN";

/* Authenticating... */
"kAuthenticating" = "Authenticating...";

/* Deauthenticating... */
"kDeauthenticating" = "Deauthenticating...";

/* OK - for alerts, confirmation dialogs */
"kOK" = "OK";

/* Cancel - for confirmation dialogs */
"kCancel" = "Cancel";

/* Save */
"kSave" = "Save";

/* Don't Save */
"kDontSave" = "Don\U2019t Save";

/* Save Changes? */
"kSaveChangesTitle" = "Save Changes?";

/* Do you want to save changes before quitting? */
"kSaveChangesMessageQuit" = "Do you want to save changes before quitting?";

/* Do you want to save changes before locking? */
"kSaveChangesMessageLock" = "Do you want to save changes before locking?";
